initial/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt        	endTime;

endTime         5;

deltaT          0.001;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

scalar1
{
	type scalarTransport;
	functionObjectLibs ("libsolverFunctionObjects.so");

	enabled true;

	writeControl outputTime;
	
	log yes;

	nCorr 1;

	D 0;

	field S1;
}

functions
{

probes1
{
type probes;
functionObjectLibs ("libsampling.so");
enabled true;
writeControl timeStep;
writeInterval 100;

fields
(
S1
);

probeLocations
(
(0.085 0.04 0.001) 
(0.085 0.04 0.003) 
(0.085 0.04 0.005) 
(0.085 0.04 0.007) 
(0.085 0.04 0.009) 
(0.085 0.04 0.011) 
(0.085 0.04 0.013) 
(0.085 0.04 0.015) 
(0.085 0.04 0.017) 
(0.085 0.04 0.019)
);

}

probes2
{
type probes;
functionObjectLibs ("libsampling.so");
enabled true;
writeControl timeStep;
writeInterval 100;

fields
(
S1
);

probeLocations
(
(0.085 0.04 0.021) 
(0.085 0.04 0.022) 
(0.085 0.04 0.025) 
(0.085 0.04 0.027) 
(0.085 0.04 0.029) 
(0.085 0.04 0.030) 
(0.085 0.04 0.033) 
(0.085 0.04 0.035) 
(0.085 0.04 0.037) 
(0.085 0.04 0.038)
);

}

probes3
{
type probes;
functionObjectLibs ("libsampling.so");
enabled true;
writeControl timeStep;
writeInterval 100;

fields
(
S1
);

probeLocations
(
(0.085 0.04 0.041) 
(0.085 0.04 0.043) 
(0.085 0.04 0.044) 
(0.085 0.04 0.046) 
(0.085 0.04 0.049) 
(0.085 0.04 0.051) 
(0.085 0.04 0.053) 
(0.085 0.04 0.054) 
(0.085 0.04 0.057) 
(0.085 0.04 0.059)
);

}

}


// ************************************************************************* //
