initial/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;


vertices
(
	(0 0 0)
	(1 0 0)
	(1 8 0)
	(0 8 0)

	(0 0 0.1)
	(1 0 0.1)
	(1 8 0.1)
	(0 8 0.1)

	(0 0 0.2)
	(1 0 0.2)
	(1 8 0.2)
	(0 8 0.2)
	
	(9 0 0)
	(9 8 0)
	(9 0 0.1)
	(9 8 0.1)

(0 0 0.3) 
(1 0 0.3) 
(1 8 0.3) 
(0 8 0.3) 

(0 0 0.4) 
(1 0 0.4) 
(1 8 0.4) 
(0 8 0.4) 

(9 0 0.2) 
(9 8 0.2) 
(9 0 0.3) 
(9 8 0.3) 

(0 0 0.5) 
(1 0 0.5) 
(1 8 0.5) 
(0 8 0.5) 

(0 0 0.6) 
(1 0 0.6) 
(1 8 0.6) 
(0 8 0.6) 

(9 0 0.4) 
(9 8 0.4) 
(9 0 0.5) 
(9 8 0.5) 

(0 0 0.7) 
(1 0 0.7) 
(1 8 0.7) 
(0 8 0.7) 

(0 0 0.8) 
(1 0 0.8) 
(1 8 0.8) 
(0 8 0.8) 

(9 0 0.6) 
(9 8 0.6) 
(9 0 0.7) 
(9 8 0.7) 

(0 0 0.9) 
(1 0 0.9) 
(1 8 0.9) 
(0 8 0.9) 

(0 0 1.0) 
(1 0 1.0) 
(1 8 1.0) 
(0 8 1.0) 

(9 0 0.8) 
(9 8 0.8) 
(9 0 0.9) 
(9 8 0.9) 

(0 0 1.1) 
(1 0 1.1) 
(1 8 1.1) 
(0 8 1.1) 

(0 0 1.2) 
(1 0 1.2) 
(1 8 1.2) 
(0 8 1.2) 

(9 0 1.0) 
(9 8 1.0) 
(9 0 1.1) 
(9 8 1.1) 

(0 0 1.3) 
(1 0 1.3) 
(1 8 1.3) 
(0 8 1.3) 

(0 0 1.4) 
(1 0 1.4) 
(1 8 1.4) 
(0 8 1.4) 

(9 0 1.2) 
(9 8 1.2) 
(9 0 1.3) 
(9 8 1.3) 

(0 0 1.5) 
(1 0 1.5) 
(1 8 1.5) 
(0 8 1.5) 

(0 0 1.6) 
(1 0 1.6) 
(1 8 1.6) 
(0 8 1.6) 

(9 0 1.4) 
(9 8 1.4) 
(9 0 1.5) 
(9 8 1.5) 

(0 0 1.7) 
(1 0 1.7) 
(1 8 1.7) 
(0 8 1.7) 

(0 0 1.8) 
(1 0 1.8) 
(1 8 1.8) 
(0 8 1.8) 

(9 0 1.6) 
(9 8 1.6) 
(9 0 1.7) 
(9 8 1.7) 

(0 0 1.9) 
(1 0 1.9) 
(1 8 1.9) 
(0 8 1.9) 

(0 0 2.0) 
(1 0 2.0) 
(1 8 2.0) 
(0 8 2.0) 

(9 0 1.8) 
(9 8 1.8) 
(9 0 1.9) 
(9 8 1.9) 

(0 0 2.1) 
(1 0 2.1) 
(1 8 2.1) 
(0 8 2.1) 

(0 0 2.2) 
(1 0 2.2) 
(1 8 2.2) 
(0 8 2.2) 

(9 0 2.0) 
(9 8 2.0) 
(9 0 2.1) 
(9 8 2.1) 

(0 0 2.3) 
(1 0 2.3) 
(1 8 2.3) 
(0 8 2.3) 

(0 0 2.4) 
(1 0 2.4) 
(1 8 2.4) 
(0 8 2.4) 

(9 0 2.2) 
(9 8 2.2) 
(9 0 2.3) 
(9 8 2.3) 

(0 0 2.5) 
(1 0 2.5) 
(1 8 2.5) 
(0 8 2.5) 

(0 0 2.6) 
(1 0 2.6) 
(1 8 2.6) 
(0 8 2.6) 

(9 0 2.4) 
(9 8 2.4) 
(9 0 2.5) 
(9 8 2.5) 

(0 0 2.7) 
(1 0 2.7) 
(1 8 2.7) 
(0 8 2.7) 

(0 0 2.8) 
(1 0 2.8) 
(1 8 2.8) 
(0 8 2.8) 

(9 0 2.6) 
(9 8 2.6) 
(9 0 2.7) 
(9 8 2.7) 

(0 0 2.9) 
(1 0 2.9) 
(1 8 2.9) 
(0 8 2.9) 

(0 0 3.0) 
(1 0 3.0) 
(1 8 3.0) 
(0 8 3.0) 

(9 0 2.8) 
(9 8 2.8) 
(9 0 2.9) 
(9 8 2.9) 

(0 0 3.1) 
(1 0 3.1) 
(1 8 3.1) 
(0 8 3.1) 

(0 0 3.2) 
(1 0 3.2) 
(1 8 3.2) 
(0 8 3.2) 

(9 0 3.0) 
(9 8 3.0) 
(9 0 3.1) 
(9 8 3.1) 

(0 0 3.3) 
(1 0 3.3) 
(1 8 3.3) 
(0 8 3.3) 

(0 0 3.4) 
(1 0 3.4) 
(1 8 3.4) 
(0 8 3.4) 

(9 0 3.2) 
(9 8 3.2) 
(9 0 3.3) 
(9 8 3.3) 

(0 0 3.5) 
(1 0 3.5) 
(1 8 3.5) 
(0 8 3.5) 

(0 0 3.6) 
(1 0 3.6) 
(1 8 3.6) 
(0 8 3.6) 

(9 0 3.4) 
(9 8 3.4) 
(9 0 3.5) 
(9 8 3.5) 

(0 0 3.7) 
(1 0 3.7) 
(1 8 3.7) 
(0 8 3.7) 

(0 0 3.8) 
(1 0 3.8) 
(1 8 3.8) 
(0 8 3.8) 

(9 0 3.6) 
(9 8 3.6) 
(9 0 3.7) 
(9 8 3.7) 

(0 0 3.9) 
(1 0 3.9) 
(1 8 3.9) 
(0 8 3.9) 

(0 0 4.0) 
(1 0 4.0) 
(1 8 4.0) 
(0 8 4.0) 

(9 0 3.8) 
(9 8 3.8) 
(9 0 3.9) 
(9 8 3.9) 

(0 0 4.1) 
(1 0 4.1) 
(1 8 4.1) 
(0 8 4.1) 

(0 0 4.2) 
(1 0 4.2) 
(1 8 4.2) 
(0 8 4.2) 

(9 0 4.0) 
(9 8 4.0) 
(9 0 4.1) 
(9 8 4.1) 

(0 0 4.3) 
(1 0 4.3) 
(1 8 4.3) 
(0 8 4.3) 

(0 0 4.4) 
(1 0 4.4) 
(1 8 4.4) 
(0 8 4.4) 

(9 0 4.2) 
(9 8 4.2) 
(9 0 4.3) 
(9 8 4.3) 

(0 0 4.5) 
(1 0 4.5) 
(1 8 4.5) 
(0 8 4.5) 

(0 0 4.6) 
(1 0 4.6) 
(1 8 4.6) 
(0 8 4.6) 

(9 0 4.4) 
(9 8 4.4) 
(9 0 4.5) 
(9 8 4.5) 

(0 0 4.7) 
(1 0 4.7) 
(1 8 4.7) 
(0 8 4.7) 

(0 0 4.8) 
(1 0 4.8) 
(1 8 4.8) 
(0 8 4.8) 

(9 0 4.6) 
(9 8 4.6) 
(9 0 4.7) 
(9 8 4.7) 

(0 0 4.9) 
(1 0 4.9) 
(1 8 4.9) 
(0 8 4.9) 

(0 0 5.0) 
(1 0 5.0) 
(1 8 5.0) 
(0 8 5.0) 

(9 0 4.8) 
(9 8 4.8) 
(9 0 4.9) 
(9 8 4.9) 

(0 0 5.1) 
(1 0 5.1) 
(1 8 5.1) 
(0 8 5.1) 

(0 0 5.2) 
(1 0 5.2) 
(1 8 5.2) 
(0 8 5.2) 

(9 0 5.0) 
(9 8 5.0) 
(9 0 5.1) 
(9 8 5.1) 

(0 0 5.3) 
(1 0 5.3) 
(1 8 5.3) 
(0 8 5.3) 

(0 0 5.4) 
(1 0 5.4) 
(1 8 5.4) 
(0 8 5.4) 

(9 0 5.2) 
(9 8 5.2) 
(9 0 5.3) 
(9 8 5.3) 

(0 0 5.5) 
(1 0 5.5) 
(1 8 5.5) 
(0 8 5.5) 

(0 0 5.6) 
(1 0 5.6) 
(1 8 5.6) 
(0 8 5.6) 

(9 0 5.4) 
(9 8 5.4) 
(9 0 5.5) 
(9 8 5.5) 

(0 0 5.7) 
(1 0 5.7) 
(1 8 5.7) 
(0 8 5.7) 

(0 0 5.8) 
(1 0 5.8) 
(1 8 5.8) 
(0 8 5.8) 

(9 0 5.6) 
(9 8 5.6) 
(9 0 5.7) 
(9 8 5.7) 

(0 0 5.9) 
(1 0 5.9) 
(1 8 5.9) 
(0 8 5.9) 

(0 0 6.0) 
(1 0 6.0) 
(1 8 6.0) 
(0 8 6.0) 

(9 0 5.8) 
(9 8 5.8) 
(9 0 5.9) 
(9 8 5.9) 

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (5 20 10) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) (5 20 10) simpleGrading (1 1 1)
    hex (1 12 13 2 5 14 15 6) (20 20 10) simpleGrading (0.25 1 1)

hex (8 9 10 11 16 17 18 19) (5 20 10) simpleGrading (1 1 1) 
hex (16 17 18 19 20 21 22 23) (5 20 10) simpleGrading (1 1 1) 
hex (9 24 25 10 17 26 27 18) (20 20 10) simpleGrading (0.25 1 1) 

hex (20 21 22 23 28 29 30 31) (5 20 10) simpleGrading (1 1 1) 
hex (28 29 30 31 32 33 34 35) (5 20 10) simpleGrading (1 1 1) 
hex (21 36 37 22 29 38 39 30) (20 20 10) simpleGrading (0.25 1 1) 

hex (32 33 34 35 40 41 42 43) (5 20 10) simpleGrading (1 1 1) 
hex (40 41 42 43 44 45 46 47) (5 20 10) simpleGrading (1 1 1) 
hex (33 48 49 34 41 50 51 42) (20 20 10) simpleGrading (0.25 1 1) 

hex (44 45 46 47 52 53 54 55) (5 20 10) simpleGrading (1 1 1) 
hex (52 53 54 55 56 57 58 59) (5 20 10) simpleGrading (1 1 1) 
hex (45 60 61 46 53 62 63 54) (20 20 10) simpleGrading (0.25 1 1) 

hex (56 57 58 59 64 65 66 67) (5 20 10) simpleGrading (1 1 1) 
hex (64 65 66 67 68 69 70 71) (5 20 10) simpleGrading (1 1 1) 
hex (57 72 73 58 65 74 75 66) (20 20 10) simpleGrading (0.25 1 1) 

hex (68 69 70 71 76 77 78 79) (5 20 10) simpleGrading (1 1 1) 
hex (76 77 78 79 80 81 82 83) (5 20 10) simpleGrading (1 1 1) 
hex (69 84 85 70 77 86 87 78) (20 20 10) simpleGrading (0.25 1 1) 

hex (80 81 82 83 88 89 90 91) (5 20 10) simpleGrading (1 1 1) 
hex (88 89 90 91 92 93 94 95) (5 20 10) simpleGrading (1 1 1) 
hex (81 96 97 82 89 98 99 90) (20 20 10) simpleGrading (0.25 1 1) 

hex (92 93 94 95 100 101 102 103) (5 20 10) simpleGrading (1 1 1) 
hex (100 101 102 103 104 105 106 107) (5 20 10) simpleGrading (1 1 1) 
hex (93 108 109 94 101 110 111 102) (20 20 10) simpleGrading (0.25 1 1) 

hex (104 105 106 107 112 113 114 115) (5 20 10) simpleGrading (1 1 1) 
hex (112 113 114 115 116 117 118 119) (5 20 10) simpleGrading (1 1 1) 
hex (105 120 121 106 113 122 123 114) (20 20 10) simpleGrading (0.25 1 1) 

hex (116 117 118 119 124 125 126 127) (5 20 10) simpleGrading (1 1 1) 
hex (124 125 126 127 128 129 130 131) (5 20 10) simpleGrading (1 1 1) 
hex (117 132 133 118 125 134 135 126) (20 20 10) simpleGrading (0.25 1 1) 

hex (128 129 130 131 136 137 138 139) (5 20 10) simpleGrading (1 1 1) 
hex (136 137 138 139 140 141 142 143) (5 20 10) simpleGrading (1 1 1) 
hex (129 144 145 130 137 146 147 138) (20 20 10) simpleGrading (0.25 1 1) 

hex (140 141 142 143 148 149 150 151) (5 20 10) simpleGrading (1 1 1) 
hex (148 149 150 151 152 153 154 155) (5 20 10) simpleGrading (1 1 1) 
hex (141 156 157 142 149 158 159 150) (20 20 10) simpleGrading (0.25 1 1) 

hex (152 153 154 155 160 161 162 163) (5 20 10) simpleGrading (1 1 1) 
hex (160 161 162 163 164 165 166 167) (5 20 10) simpleGrading (1 1 1) 
hex (153 168 169 154 161 170 171 162) (20 20 10) simpleGrading (0.25 1 1) 

hex (164 165 166 167 172 173 174 175) (5 20 10) simpleGrading (1 1 1) 
hex (172 173 174 175 176 177 178 179) (5 20 10) simpleGrading (1 1 1) 
hex (165 180 181 166 173 182 183 174) (20 20 10) simpleGrading (0.25 1 1) 

hex (176 177 178 179 184 185 186 187) (5 20 10) simpleGrading (1 1 1) 
hex (184 185 186 187 188 189 190 191) (5 20 10) simpleGrading (1 1 1) 
hex (177 192 193 178 185 194 195 186) (20 20 10) simpleGrading (0.25 1 1) 

hex (188 189 190 191 196 197 198 199) (5 20 10) simpleGrading (1 1 1) 
hex (196 197 198 199 200 201 202 203) (5 20 10) simpleGrading (1 1 1) 
hex (189 204 205 190 197 206 207 198) (20 20 10) simpleGrading (0.25 1 1) 

hex (200 201 202 203 208 209 210 211) (5 20 10) simpleGrading (1 1 1) 
hex (208 209 210 211 212 213 214 215) (5 20 10) simpleGrading (1 1 1) 
hex (201 216 217 202 209 218 219 210) (20 20 10) simpleGrading (0.25 1 1) 

hex (212 213 214 215 220 221 222 223) (5 20 10) simpleGrading (1 1 1) 
hex (220 221 222 223 224 225 226 227) (5 20 10) simpleGrading (1 1 1) 
hex (213 228 229 214 221 230 231 222) (20 20 10) simpleGrading (0.25 1 1) 

hex (224 225 226 227 232 233 234 235) (5 20 10) simpleGrading (1 1 1) 
hex (232 233 234 235 236 237 238 239) (5 20 10) simpleGrading (1 1 1) 
hex (225 240 241 226 233 242 243 234) (20 20 10) simpleGrading (0.25 1 1) 

hex (236 237 238 239 244 245 246 247) (5 20 10) simpleGrading (1 1 1) 
hex (244 245 246 247 248 249 250 251) (5 20 10) simpleGrading (1 1 1) 
hex (237 252 253 238 245 254 255 246) (20 20 10) simpleGrading (0.25 1 1) 

hex (248 249 250 251 256 257 258 259) (5 20 10) simpleGrading (1 1 1) 
hex (256 257 258 259 260 261 262 263) (5 20 10) simpleGrading (1 1 1) 
hex (249 264 265 250 257 266 267 258) (20 20 10) simpleGrading (0.25 1 1) 

hex (260 261 262 263 268 269 270 271) (5 20 10) simpleGrading (1 1 1) 
hex (268 269 270 271 272 273 274 275) (5 20 10) simpleGrading (1 1 1) 
hex (261 276 277 262 269 278 279 270) (20 20 10) simpleGrading (0.25 1 1) 

hex (272 273 274 275 280 281 282 283) (5 20 10) simpleGrading (1 1 1) 
hex (280 281 282 283 284 285 286 287) (5 20 10) simpleGrading (1 1 1) 
hex (273 288 289 274 281 290 291 282) (20 20 10) simpleGrading (0.25 1 1) 

hex (284 285 286 287 292 293 294 295) (5 20 10) simpleGrading (1 1 1) 
hex (292 293 294 295 296 297 298 299) (5 20 10) simpleGrading (1 1 1) 
hex (285 300 301 286 293 302 303 294) (20 20 10) simpleGrading (0.25 1 1) 

hex (296 297 298 299 304 305 306 307) (5 20 10) simpleGrading (1 1 1) 
hex (304 305 306 307 308 309 310 311) (5 20 10) simpleGrading (1 1 1) 
hex (297 312 313 298 305 314 315 306) (20 20 10) simpleGrading (0.25 1 1) 

hex (308 309 310 311 316 317 318 319) (5 20 10) simpleGrading (1 1 1) 
hex (316 317 318 319 320 321 322 323) (5 20 10) simpleGrading (1 1 1) 
hex (309 324 325 310 317 326 327 318) (20 20 10) simpleGrading (0.25 1 1) 

hex (320 321 322 323 328 329 330 331) (5 20 10) simpleGrading (1 1 1) 
hex (328 329 330 331 332 333 334 335) (5 20 10) simpleGrading (1 1 1) 
hex (321 336 337 322 329 338 339 330) (20 20 10) simpleGrading (0.25 1 1) 

hex (332 333 334 335 340 341 342 343) (5 20 10) simpleGrading (1 1 1) 
hex (340 341 342 343 344 345 346 347) (5 20 10) simpleGrading (1 1 1) 
hex (333 348 349 334 341 350 351 342) (20 20 10) simpleGrading (0.25 1 1) 

hex (344 345 346 347 352 353 354 355) (5 20 10) simpleGrading (1 1 1) 
hex (352 353 354 355 356 357 358 359) (5 20 10) simpleGrading (1 1 1) 
hex (345 360 361 346 353 362 363 354) (20 20 10) simpleGrading (0.25 1 1) 

);

edges
(
);

boundary
(
    inlet_steam
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    inlet_h2
    {
        type wall;
        faces
        (
            (5 14 15 6)
(17 26 27 18) 
(29 38 39 30) 
(41 50 51 42) 
(53 62 63 54) 
(65 74 75 66) 
(77 86 87 78) 
(89 98 99 90) 
(101 110 111 102) 
(113 122 123 114) 
(125 134 135 126) 
(137 146 147 138) 
(149 158 159 150) 
(161 170 171 162) 
(173 182 183 174) 
(185 194 195 186) 
(197 206 207 198) 
(209 218 219 210) 
(221 230 231 222) 
(233 242 243 234) 
(245 254 255 246) 
(257 266 267 258) 
(269 278 279 270) 
(281 290 291 282) 
(293 302 303 294) 
(305 314 315 306) 
(317 326 327 318) 
(329 338 339 330) 
(341 350 351 342) 
(353 362 363 354) 

        );
    }
   
    no_slip
    {
        type wall;
        faces
        (

	    (356 357 358 359)
            (0 1 5 4)
	    (4 5 9 8)
	    (5 6 10 9)
	    (2 3 7 6)
	    (6 7 11 10)
	    (3 0 4 7)
	    (7 4 8 11)

            (1 12 14 5)
	    (1 12 13 2)
	    (2 13 15 6)

(8 9 17 16) 
(16 17 21 20) 
(17 18 22 21) 
(10 11 19 18) 
(18 19 23 22) 
(11 8 16 19) 
(19 16 20 23) 

(9 24 25 10) 
(9 24 26 17) 
(10 25 27 18) 

(20 21 29 28) 
(28 29 33 32) 
(29 30 34 33) 
(22 23 31 30) 
(30 31 35 34) 
(23 20 28 31) 
(31 28 32 35) 

(21 36 37 22) 
(21 36 38 29) 
(22 37 39 30) 

(32 33 41 40) 
(40 41 45 44) 
(41 42 46 45) 
(34 35 43 42) 
(42 43 47 46) 
(35 32 40 43) 
(43 40 44 47) 

(33 48 49 34) 
(33 48 50 41) 
(34 49 51 42) 

(44 45 53 52) 
(52 53 57 56) 
(53 54 58 57) 
(46 47 55 54) 
(54 55 59 58) 
(47 44 52 55) 
(55 52 56 59) 

(45 60 61 46) 
(45 60 62 53) 
(46 61 63 54) 

(56 57 65 64) 
(64 65 69 68) 
(65 66 70 69) 
(58 59 67 66) 
(66 67 71 70) 
(59 56 64 67) 
(67 64 68 71) 

(57 72 73 58) 
(57 72 74 65) 
(58 73 75 66) 

(68 69 77 76) 
(76 77 81 80) 
(77 78 82 81) 
(70 71 79 78) 
(78 79 83 82) 
(71 68 76 79) 
(79 76 80 83) 

(69 84 85 70) 
(69 84 86 77) 
(70 85 87 78) 

(80 81 89 88) 
(88 89 93 92) 
(89 90 94 93) 
(82 83 91 90) 
(90 91 95 94) 
(83 80 88 91) 
(91 88 92 95) 

(81 96 97 82) 
(81 96 98 89) 
(82 97 99 90) 

(92 93 101 100) 
(100 101 105 104) 
(101 102 106 105) 
(94 95 103 102) 
(102 103 107 106) 
(95 92 100 103) 
(103 100 104 107) 

(93 108 109 94) 
(93 108 110 101) 
(94 109 111 102) 

(104 105 113 112) 
(112 113 117 116) 
(113 114 118 117) 
(106 107 115 114) 
(114 115 119 118) 
(107 104 112 115) 
(115 112 116 119) 

(105 120 121 106) 
(105 120 122 113) 
(106 121 123 114) 

(116 117 125 124) 
(124 125 129 128) 
(125 126 130 129) 
(118 119 127 126) 
(126 127 131 130) 
(119 116 124 127) 
(127 124 128 131) 

(117 132 133 118) 
(117 132 134 125) 
(118 133 135 126) 

(128 129 137 136) 
(136 137 141 140) 
(137 138 142 141) 
(130 131 139 138) 
(138 139 143 142) 
(131 128 136 139) 
(139 136 140 143) 

(129 144 145 130) 
(129 144 146 137) 
(130 145 147 138) 

(140 141 149 148) 
(148 149 153 152) 
(149 150 154 153) 
(142 143 151 150) 
(150 151 155 154) 
(143 140 148 151) 
(151 148 152 155) 

(141 156 157 142) 
(141 156 158 149) 
(142 157 159 150) 

(152 153 161 160) 
(160 161 165 164) 
(161 162 166 165) 
(154 155 163 162) 
(162 163 167 166) 
(155 152 160 163) 
(163 160 164 167) 

(153 168 169 154) 
(153 168 170 161) 
(154 169 171 162) 

(164 165 173 172) 
(172 173 177 176) 
(173 174 178 177) 
(166 167 175 174) 
(174 175 179 178) 
(167 164 172 175) 
(175 172 176 179) 

(165 180 181 166) 
(165 180 182 173) 
(166 181 183 174) 

(176 177 185 184) 
(184 185 189 188) 
(185 186 190 189) 
(178 179 187 186) 
(186 187 191 190) 
(179 176 184 187) 
(187 184 188 191) 

(177 192 193 178) 
(177 192 194 185) 
(178 193 195 186) 

(188 189 197 196) 
(196 197 201 200) 
(197 198 202 201) 
(190 191 199 198) 
(198 199 203 202) 
(191 188 196 199) 
(199 196 200 203) 

(189 204 205 190) 
(189 204 206 197) 
(190 205 207 198) 

(200 201 209 208) 
(208 209 213 212) 
(209 210 214 213) 
(202 203 211 210) 
(210 211 215 214) 
(203 200 208 211) 
(211 208 212 215) 

(201 216 217 202) 
(201 216 218 209) 
(202 217 219 210) 

(212 213 221 220) 
(220 221 225 224) 
(221 222 226 225) 
(214 215 223 222) 
(222 223 227 226) 
(215 212 220 223) 
(223 220 224 227) 

(213 228 229 214) 
(213 228 230 221) 
(214 229 231 222) 

(224 225 233 232) 
(232 233 237 236) 
(233 234 238 237) 
(226 227 235 234) 
(234 235 239 238) 
(227 224 232 235) 
(235 232 236 239) 

(225 240 241 226) 
(225 240 242 233) 
(226 241 243 234) 

(236 237 245 244) 
(244 245 249 248) 
(245 246 250 249) 
(238 239 247 246) 
(246 247 251 250) 
(239 236 244 247) 
(247 244 248 251) 

(237 252 253 238) 
(237 252 254 245) 
(238 253 255 246) 

(248 249 257 256) 
(256 257 261 260) 
(257 258 262 261) 
(250 251 259 258) 
(258 259 263 262) 
(251 248 256 259) 
(259 256 260 263) 

(249 264 265 250) 
(249 264 266 257) 
(250 265 267 258) 

(260 261 269 268) 
(268 269 273 272) 
(269 270 274 273) 
(262 263 271 270) 
(270 271 275 274) 
(263 260 268 271) 
(271 268 272 275) 

(261 276 277 262) 
(261 276 278 269) 
(262 277 279 270) 

(272 273 281 280) 
(280 281 285 284) 
(281 282 286 285) 
(274 275 283 282) 
(282 283 287 286) 
(275 272 280 283) 
(283 280 284 287) 

(273 288 289 274) 
(273 288 290 281) 
(274 289 291 282) 

(284 285 293 292) 
(292 293 297 296) 
(293 294 298 297) 
(286 287 295 294) 
(294 295 299 298) 
(287 284 292 295) 
(295 292 296 299) 

(285 300 301 286) 
(285 300 302 293) 
(286 301 303 294) 

(296 297 305 304) 
(304 305 309 308) 
(305 306 310 309) 
(298 299 307 306) 
(306 307 311 310) 
(299 296 304 307) 
(307 304 308 311) 

(297 312 313 298) 
(297 312 314 305) 
(298 313 315 306) 

(308 309 317 316) 
(316 317 321 320) 
(317 318 322 321) 
(310 311 319 318) 
(318 319 323 322) 
(311 308 316 319) 
(319 316 320 323) 

(309 324 325 310) 
(309 324 326 317) 
(310 325 327 318) 

(320 321 329 328) 
(328 329 333 332) 
(329 330 334 333) 
(322 323 331 330) 
(330 331 335 334) 
(323 320 328 331) 
(331 328 332 335) 

(321 336 337 322) 
(321 336 338 329) 
(322 337 339 330) 

(332 333 341 340) 
(340 341 345 344) 
(341 342 346 345) 
(334 335 343 342) 
(342 343 347 346) 
(335 332 340 343) 
(343 340 344 347) 

(333 348 349 334) 
(333 348 350 341) 
(334 349 351 342) 

(344 345 353 352) 
(352 353 357 356) 
(353 354 358 357) 
(346 347 355 354) 
(354 355 359 358) 
(347 344 352 355) 
(355 352 356 359) 

(345 360 361 346) 
(345 360 362 353) 
(346 361 363 354) 

		
        );
    }

    outlet
    {
	type wall;
	faces
	(
	   (12 13 15 14)
(24 25 27 26) 
(36 37 39 38) 
(48 49 51 50) 
(60 61 63 62) 
(72 73 75 74) 
(84 85 87 86) 
(96 97 99 98) 
(108 109 111 110) 
(120 121 123 122) 
(132 133 135 134) 
(144 145 147 146) 
(156 157 159 158) 
(168 169 171 170) 
(180 181 183 182) 
(192 193 195 194) 
(204 205 207 206) 
(216 217 219 218) 
(228 229 231 230) 
(240 241 243 242) 
(252 253 255 254) 
(264 265 267 266) 
(276 277 279 278) 
(288 289 291 290) 
(300 301 303 302) 
(312 313 315 314) 
(324 325 327 326) 
(336 337 339 338) 
(348 349 351 350) 
(360 361 363 362) 

	);
    }

	
);

mergePatchPairs
(
);

// ************************************************************************* //
