initial/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet_steam
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       506900;
    }
    inlet_h2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          12000;
        startFace       507000;
    }
    no_slip
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          48100;
        startFace       519000;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          6000;
        startFace       567100;
    }
)

// ************************************************************************* //
