initial/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet_steam
    {
        type            fixedValue;
        value           uniform (0 0 0.0366);
    }

    inlet_h2
    {
        type            fixedValue;
        value           uniform (0 0 -6.73e-6);
    }

    outlet
    {
        type            inletOutlet;
	inletValue	uniform (0 0 0);
	value		uniform (0 0 0);
    }

    no_slip
    {
        type            noSlip;
    }

    empty
    {
        type            empty;
    }


}

// ************************************************************************* //
